# GetXPropVersion

## Description
```pascal
PROCEDURE GetXPropVersion(VAR outVersion : LONGINT);
```

```python

def vs.GetXPropVersion():
    return outVersion
```

## Parameters
|Name|Type|Description|
|---|---|---|
|outVersion|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events